recipes/firecracker-vegan-lettuce-wraps.html
<?xml version="1.0" encoding="utf-8"?>
<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Strict//EN"
"http://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd">
<html xmlns="http://www.w3.org/1999/xhtml" lang="en" xml:lang="en">
<head>
<meta http-equiv="Content-Type" content="text/html;charset=utf-8" />
<meta name="viewport" content="width=device-width, initial-scale=1" />
<title>Firecracker Vegan Lettuce Wraps</title>
<meta name="generator" content="Org mode" />
<meta name="author" content="james" />
<link rel="stylesheet" type="text/css" href="../static/recipe.css" />
<link rel="icon" type="image/ico" href="../static/favicon.svg" />
</head>
<body>
<div id="org-div-home-and-up"> <a href="../index.html"> Home </a> </div> <div id="btns"><button id="copy-btn" onclick="copyTicked()"></button> <button id="untick-btn" onclick="untickAll()"></button></div><div id="notify">Copied!</div><div id="content">
<h1 class="title">Firecracker Vegan Lettuce Wraps</h1>
<p>
<a href="https://pinchofyum.com/vegan-lettuce-wraps">Original link</a>
</p>

<div id="outline-container-orgca76042" class="outline-2">
<h2 id="orgca76042">Ingredients</h2>
<div class="outline-text-2" id="text-orgca76042">
</div>
<div id="outline-container-orgd231cd0" class="outline-3">
<h3 id="orgd231cd0">Sauce</h3>
<div class="outline-text-3" id="text-orgd231cd0">
<ul class="org-ul">
<li>1/2 cup peanut butter</li>
<li>1/3 cup low sodium soy sauce</li>
<li>1/3 cup sesame oil</li>
<li>1/4 cup rice vinegar</li>
<li>2 tablespoons chili paste (like sambal oelek) ++ for more</li>
<li>firecrackery-ness</li>
<li>2 tablespoons sugar</li>
<li>a small knob of fresh ginger, peeled</li>
<li>a clove of fresh garlic, peeled</li>
</ul>
</div>
</div>

<div id="outline-container-orgcb7476c" class="outline-3">
<h3 id="orgcb7476c">Other</h3>
<div class="outline-text-3" id="text-orgcb7476c">
<ul class="org-ul">
<li>1 container extra firm tofu (see notes)</li>
<li>150 g brown rice noodles</li>
<li>lettuce leaves for wrapping</li>
<li>peanuts, cilantro, lime for serving</li>
</ul>
</div>
</div>
</div>

<div id="outline-container-org966843d" class="outline-2">
<h2 id="org966843d">Method</h2>
<div class="outline-text-2" id="text-org966843d">
<ol class="org-ol">
<li>Noodle Prep: Soak your noodles in a bowl of lukewarm water for at least 30 minutes while prepping the rest of the recipe. You want the noodles to be soft and flexible.</li>
<li>Sauce: Blend all the sauce ingredients together in a small blender or food processor until smooth and creamy.</li>
<li>Tofu: Press the tofu with a few paper towels to get some of the moisture out. Cut the tofu into small pieces. Heat a little oil in a nonstick skillet. Add your tofu. Stir-fry until golden brown. I usually let it saute for at least 15 minutes. Add about half of the sauce to the pan. Stir-fry for another 3-5 minutes. As the sauce browns, it will form small crispy pieces around the tofu. Yum! Transfer tofu to a bowl.</li>
<li>Noodles: Drain and rinse your noodles. Add another swish of oil to the pan and plop the noodles in. Add about half of the remaining sauce. Stir fry for just a minute or two until coated. Add a splash of water if it's too sticky. Remove from heat immediately and toss with the tofu.</li>
<li>Lettuce Wrap It Up: Fill your butter lettuce leaves with the noodle/tofu mixture (it's okay if it's sticky &#x2013; you're just wrapping it up in lettuce). Top with peanuts, cashews, cilantro, scallions, lime, and/or Sriracha if you want.</li>
</ol>
</div>
</div>
</div>
</body>
</html>
